#Область ОбработчикиСобытий
 Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Дополнение = СтрШаблон(" (на осн. %1)",Данные.ДействуетНаОсновании);
		Представление = Представление + Дополнение;
		//Представление = Представление + " (на осн." + Данные.ДействуетНаОсновании + ")";
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
        
    СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры
#КонецОбласти